src/Documents/ПеремещениеВозврата/ПеремещениеВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеВозврата</name>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>ТочкаРаздачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Списать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДниХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.ВозвратГруппОрганизатору</types>
        <types>DocumentRef.ВозвратПокупокОрганизатору</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Возвраты/Возвраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Возвраты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Участники</types>
      <types>CatalogRef.Организаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВозвратГруппОрганизатору</types>
      <types>DocumentRef.ВозвратПокупокОрганизатору</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ДвижениеТранзита</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПеремещениеВозврата/Forms/ФормаДокумента/Module.bsl
Функция ЗаполнитьВозвраты() 
	Если Объект.Проведен Тогда
		Сообщить("Нельзя заполнить проведенный документ!!!");	
	Иначе	
		Объект.Покупки.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратыОстаткиИОбороты.Организатор,
		|	ВозвратыОстаткиИОбороты.Участник,
		|	ВозвратыОстаткиИОбороты.Покупка,
		|	ВозвратыОстаткиИОбороты.МестоХранения,
		|	ВозвратыОстаткиИОбороты.Партия,
		|	СУММА(ВозвратыОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток
		|ПОМЕСТИТЬ Перед
		|ИЗ
		|	РегистрНакопления.Возвраты.ОстаткиИОбороты(, &НаДату, Авто, ДвиженияИГраницыПериода, ) КАК ВозвратыОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратыОстаткиИОбороты.Организатор,
		|	ВозвратыОстаткиИОбороты.Партия,
		|	ВозвратыОстаткиИОбороты.Участник,
		|	ВозвратыОстаткиИОбороты.Покупка,
		|	ВозвратыОстаткиИОбороты.МестоХранения
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВозвратыОстаткиИОбороты.КоличествоКонечныйОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Перед.Организатор КАК Организатор,
		|	Перед.Участник,
		|	Перед.Покупка,
		|	Перед.МестоХранения,
		|	Перед.Партия КАК Партия,
		|	РАЗНОСТЬДАТ(ЕСТЬNULL(Перед.Партия.Дата, ДАТАВРЕМЯ(1, 1, 1)), &НаДату, ДЕНЬ) КАК ДниХранения,
		|	Перед.КоличествоКонечныйОстаток КАК Количество
		|ИЗ
		|	Перед КАК Перед
		//|ГДЕ
		//|	РАЗНОСТЬДАТ(ЕСТЬNULL(Перед.Партия.Дата, ДАТАВРЕМЯ(1, 1, 1)), &НаДату, ДЕНЬ) > &ДнейХранения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организатор,
		|	Партия";
		
		
		
		Запрос.Параметры.Вставить("НаДату",КонецДня(ТекущаяДата()));
		Запрос.Параметры.Вставить("ДнейХранения",Объект.ДниХранения);
		Результат = Запрос.Выполнить();
		тз=Результат.Выгрузить();
		Объект.Покупки.Загрузить(тз);
	КонецЕсли;
КонецФункции 


&НаКлиенте
Процедура Заполнить(Команда)
	
	тз=	ЗаполнитьВозвраты();

КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ДниХранения.Видимость=Объект.Списать;	
	Элементы.ТочкаРаздачи.Видимость= не Объект.Списать;	

КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
Процедура ДниХраненияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СписатьПриИзменении(Элемент)
	УстановитьВидимость()

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтбору(Команда)
	фрм=ПолучитьФорму("Документ.ПеремещениеВозврата.Форма.ФормаОтбора",новый Структура("имяСхемы","СКДОтборВозвраты"),ЭтаФорма);
	фрм.Открыть();
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	КомпоновщикНастроек	= ВыбранноеЗначение.КомпоновщикНастроек;
	Схема				= ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресСхемы);
	
	настройки						= КомпоновщикНастроек.Настройки;
	параметрПериод					= настройки.ПараметрыДанных.НайтиЗначениеПараметра(новый ПараметрКомпоновкиДанных("НаДату"));
	параметрПериод.Значение			= КонецДня(Объект.Дата);
	параметрПериод.Использование	= Истина;
	
	КомпановщикМакета				= Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет							= КомпановщикМакета.Выполнить(Схема,КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки				= новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	ПроцессорВывода					= новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ								= новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки,Истина);
	Объект.Покупки.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры



#Область СобытияФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СП_РаботаСДокументами.ПриСозданииНаСервере(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
